app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(
      first_name: params[:first_name],
      last_name: params[:last_name]
    )
---
SELECT "users".* FROM "users" WHERE "users"."first_name" = '3' AND "users"."last_name" = '33' LIMIT 1