app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "age", "city", "created_at", "updated_at") VALUES ('4', '44', NULL, '', '2025-10-26 04:57:45.712204', '2025-10-26 04:57:45.712204') RETURNING "id"